In [102]:
import matplotlib
%matplotlib inline

import pandas as pd

In [103]:
df_prix = pd.read_csv('datas/Prix_Petrole_Brut.csv')
df_production = pd.read_csv('datas/Production_Petrole_Brut.csv')
df_approvisionnement = pd.read_csv('datas/Approvisionnement_Energie_Primaire.csv')

df = pd.DataFrame()

In [113]:
df = df_approvisionnement.join(df_production,lsuffix='_approvisionnement', rsuffix='_production')

In [114]:
df.head()

,LOCATION_approvisionnement,INDICATOR_approvisionnement,SUBJECT_approvisionnement,MEASURE_approvisionnement,FREQUENCY_approvisionnement,TIME_approvisionnement,Value_approvisionnement,Flag Codes_approvisionnement,LOCATION_production,INDICATOR_production,SUBJECT_production,MEASURE_production,FREQUENCY_production,TIME_production,Value_production,Flag Codes_production
0,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,1980,0.191,NaN,AUS,OILPROD,TOT,KTOE,A,1980,19471.877,NaN
1,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,1981,0.186,NaN,AUS,OILPROD,TOT,KTOE,A,1981,19007.475,NaN
2,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,1982,0.198,NaN,AUS,OILPROD,TOT,KTOE,A,1982,18706.129,NaN
3,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,1983,0.182,NaN,AUS,OILPROD,TOT,KTOE,A,1983,18220.054,NaN
4,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,1984,0.178,NaN,AUS,OILPROD,TOT,KTOE,A,1984,22148.899,NaN

In [121]:
df = df.set_index('TIME_approvisionnement')

In [123]:
# del df['TIME_production']

In [129]:
df = df.rename(index=str,columns={"TIME_approvisionnement" : "TIME"})
df.head()

,LOCATION_approvisionnement,INDICATOR_approvisionnement,SUBJECT_approvisionnement,MEASURE_approvisionnement,FREQUENCY_approvisionnement,Value_approvisionnement,Flag Codes_approvisionnement,LOCATION_production,INDICATOR_production,SUBJECT_production,MEASURE_production,FREQUENCY_production,Value_production,Flag Codes_production
TIME_approvisionnement,,,,,,,,,,,,,,
1980,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,0.191,NaN,AUS,OILPROD,TOT,KTOE,A,19471.877,NaN
1981,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,0.186,NaN,AUS,OILPROD,TOT,KTOE,A,19007.475,NaN
1982,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,0.198,NaN,AUS,OILPROD,TOT,KTOE,A,18706.129,NaN
1983,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,0.182,NaN,AUS,OILPROD,TOT,KTOE,A,18220.054,NaN
1984,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,0.178,NaN,AUS,OILPROD,TOT,KTOE,A,22148.899,NaN

In [105]:
# df_production['Value_Production'] = df_production['Value']
# del df_production['Value']
df_production.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME      Value Flag Codes
0      AUS   OILPROD     TOT    KTOE         A  1980  19471.877        NaN
1      AUS   OILPROD     TOT    KTOE         A  1981  19007.475        NaN
2      AUS   OILPROD     TOT    KTOE         A  1982  18706.129        NaN
3      AUS   OILPROD     TOT    KTOE         A  1983  18220.054        NaN
4      AUS   OILPROD     TOT    KTOE         A  1984  22148.899        NaN

In [106]:
# df_approvisionnement['Value_Approvisionnement'] = df_approvisionnement['Value']
# del df_approvisionnement['Value']
df_approvisionnement.head()

,LOCATION,INDICATOR,SUBJECT,MEASURE,FREQUENCY,TIME,Value,Flag Codes
0,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,1980,0.191,NaN
1,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,1981,0.186,NaN
2,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,1982,0.198,NaN
3,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,1983,0.182,NaN
4,AUS,PRYENRGSUPPLY,TOT,TOE_1000USD,A,1984,0.178,NaN

In [76]:
df_prix .info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1064 entries, 0 to 1063
Data columns (total 8 columns):
LOCATION      1064 non-null object
INDICATOR     1064 non-null object
SUBJECT       1064 non-null object
MEASURE       1064 non-null object
FREQUENCY     1064 non-null object
TIME          1064 non-null int64
Value         875 non-null float64
Flag Codes    189 non-null object
dtypes: float64(1), int64(1), object(6)
memory usage: 66.6+ KB

In [77]:
df_prix.head()

  LOCATION    INDICATOR SUBJECT  MEASURE FREQUENCY  TIME  Value Flag Codes
0      AUS  OILIMPPRICE     TOT  USD_BAR         A  1980  31.81        NaN
1      AUS  OILIMPPRICE     TOT  USD_BAR         A  1981  35.88        NaN
2      AUS  OILIMPPRICE     TOT  USD_BAR         A  1982  35.42        NaN
3      AUS  OILIMPPRICE     TOT  USD_BAR         A  1983  30.88        NaN
4      AUS  OILIMPPRICE     TOT  USD_BAR         A  1984  29.19        NaN

In [78]:
df_production.head()

  LOCATION INDICATOR SUBJECT MEASURE FREQUENCY  TIME      Value Flag Codes
0      AUS   OILPROD     TOT    KTOE         A  1980  19471.877        NaN
1      AUS   OILPROD     TOT    KTOE         A  1981  19007.475        NaN
2      AUS   OILPROD     TOT    KTOE         A  1982  18706.129        NaN
3      AUS   OILPROD     TOT    KTOE         A  1983  18220.054        NaN
4      AUS   OILPROD     TOT    KTOE         A  1984  22148.899        NaN

In [79]:
df_prix['LOCATION'].count()

1064

In [80]:
df = pd.DataFrame(columns=['valeur'])

In [81]:
for valeur in df_production['LOCATION']:
    df['valeur'] = valeur
    df['valeur'] += 1

In [82]:
df.head()

Empty DataFrame
Columns: [valeur]
Index: []

In [83]:
for valeur in df_production['LOCATION']:
    if

SyntaxError: invalid syntax (<ipython-input-83-17060b861c90>, line 2)

In [ ]:
df_production['LOCATION'][8206]

In [84]:
i = 0
compteur_production = 0
for i in range(len(df_production['LOCATION'])-1):
    if df_production['LOCATION'][i] != df_production['LOCATION'][i+1]:
        compteur_production += 1
print("nb LOCATION_production :",compteur_production)

nb LOCATION_production : 141

In [85]:
i = 0
compteur_prix = 0
for i in range(len(df_prix['LOCATION'])-1):
    if df_prix['LOCATION'][i] != df_prix['LOCATION'][i+1]:
        compteur_prix += 1
print("nb LOCATION_prix :",compteur_prix)

nb LOCATION_prix : 27

In [ ]:
df_production.tail()